artillery/catalog.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 10
      arrivalRate: 5
  defaults:
    headers:
      content-type: application/json

scenarios:
  - name: Create catalog item
    flow:
      - post:
          url: '/catalog'
          json:
            name: 'Produto Teste 5'
          expect:
            - statusCode: 201