artillery/catalog.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 10
scenarios:
  flow:
    - post:
        url: '/auth/login'
        json:
          email: 'user@example.com'
          password: 'secret123'
        capture:
          - json: $.accessToken
            as: accessToken
    - post:
        url: '/catalog'
        headers:
          Authorization: 'Bearer {{ accessToken }}'
        json:
          name: 'Produto Teste 5'
          price: 120
    - get:
        url: '/catalog/1'
        headers:
          Authorization: 'Bearer {{ accessToken }}'