artillery/notification.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 10
      arrivalRate: 5
scenarios:
  - name: Auth then call Notification post and fetch by Id
    flow:
      - post:
          url: '/auth/login'
          json:
            email: 'user@example.com'
            password: 'secret123'
          capture:
            - json: $.accessToken
              as: accessToken
      - post:
          url: '/notification'
          headers:
            Authorization: 'Bearer {{ accessToken }}'
          json:
            type: 'generic'
            message: 'Nova notificação'
          capture:
            - json: $.id
              as: notificationId
      - get:
          url: '/notification/1'
          headers:
            Authorization: 'Bearer {{ accessToken }}'