artillery/notification.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 10
      arrivalRate: 5
  defaults:
    headers:
      content-type: application/json
  variables:
    email: 'user@example.com'
    password: 'secret123'

scenarios:
  - name: Auth then call Notification post and fetch by Id
    flow:
      - post:
          url: '/auth/login'
          json:
            email: '{{ email }}'
            password: '{{ password }}'
          capture:
            - json: $.accessToken
              as: accessToken
          expect:
            - statusCode: 201
      - post:
          url: '/notification'
          headers:
            Authorization: 'Bearer {{ accessToken }}'
          json:
            type: 'generic'
            message: 'Nova notificação'
          capture:
            - json: $.id
              as: notificationId
          expect:
            - statusCode: 201
      - get:
          url: '/notification/1'
          headers:
            Authorization: 'Bearer {{ accessToken }}'
          expect:
            - statusCode: 200