artillery/notification.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 10
      arrivalRate: 5
  defaults:
    headers:
      content-type: application/json
  variables:
    email: 'user@example.com'
    password: 'secret123'

scenarios:
  - name: Notification create and get
    flow:
      # Login to get access token
      - post:
          url: '/auth/login'
          json:
            email: '{{ email }}'
            password: '{{ password }}'
          capture:
            - json: $.accessToken
              as: accessToken
          expect:
            - statusCode: 201

      # Create notification (protected)
      - post:
          url: '/notification'
          headers:
            Authorization: 'Bearer {{ accessToken }}'
          json:
            type: 'generic'
            message: 'Nova notificação'
          capture:
            - json: $.id
              as: notificationId
          expect:
            - statusCode: 201

      # List notifications (protected)
      - get:
          url: '/notification'
          headers:
            Authorization: 'Bearer {{ accessToken }}'
          expect:
            - statusCode: 200

      # Get by id (protected)
      - get:
          url: '/notification/{{ notificationId }}'
          headers:
            Authorization: 'Bearer {{ accessToken }}'
          expect:
            - statusCode: 200